# Ejercicio Pandas

In [1]:
import pandas as pd
import numpy as np

In [37]:
ser1 = pd.Series([1,2,3,4,5])
ser2 = pd.Series([4,5,6,7,8])
In1 = pd.Index(ser1)
In2 = pd.Index(ser2)

#df = df1.merge(df2, how = 'left')
In = In1.difference(In2)
print(pd.Series(list(In)))

0    1
1    2
2    3
dtype: int64

In [35]:
df1 = pd.DataFrame(ser1)
df2 = pd.DataFrame(ser2)
merge = pd.DataFrame({'A': ser1, 'B': ser2})
merge

   A  B
0  1  4
1  2  5
2  3  6
3  4  7
4  5  8

In [46]:
print((df1.merge(df2, how = 'inner')))

   0
0  4
1  5

In [51]:
result = ser1.isin(ser2)
print(result)
print(ser1[~result])

0    False
1    False
2    False
3     True
4     True
dtype: bool
0    1
1    2
2    3
dtype: int64

In [75]:
arr = list(range(7*5))
mat = np.reshape(arr, [7,5])
mat = pd.DataFrame(mat)
mat

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29
6  30  31  32  33  34

In [80]:
words = ['how', 'to', 'kick', 'ass']
wser = pd.Series(words)
print(wser.str.capitalize())

0     How
1      To
2    Kick
3     Ass
dtype: object

In [87]:
p = pd.Series([1,2,3,4,5,6,7,8,9,10])
q = pd.Series([10,9,8,7,6,5,4,3,2,1])

res = np.linalg.norm(np.array(p) - np.array(q))
res

18.16590212458495